Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
		// Swap y0 and y1
		uint16_t temp_y = y0;
		y0 = y1;
		y1 = temp_y;
	}

	// Calculate the horizontal and vertical distances
	int16_t dx = x1 - x0;
	int16_t dy = y1 - y0;

	// Determine the step direction for the y-axis
	int16_t y_direction = (dy < 0) ? -1 : 1;
	if (dy < 0)
		dy = -dy;

	// Initialize Bresenham's decision variables
	int16_t decision_parameter = (2 * dy) - dx;
	int16_t y = y0;

	// Iterate across the x-axis
	for (int16_t x = x0; x <= x1; x++)
	{
		// Draw the character at (x, y) in the framebuffer
		__DrawChar(c, x, y);

		// Check if decision variable is positive then move to the next y
		if (decision_parameter > 0)
		{
			y += y_direction;
			// Update error for step in both X and Y
			decision_parameter += (2 * (dy - dx));
		} else
		{
			// Update error for step in X only
			decision_parameter += (2 * dy);
		}
	}
}

/**
 * @fn static void __DrawLineVertical(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Internal function for drawing a vertical line using Bresenham's algorithm.
 * This function draws a line from (x0, y0) to (x1, y1) in the terminal framebuffer
 * using the specified character. This is a static function and does NOT perform bounds checking.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
static void __DrawLineVertical(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make sure to draw from top to bottom
	if (y0 > y1)
	{
		// Swap y0 and y1
		uint16_t temp_y = y0;
		y0 = y1;
		y1 = temp_y;

		// Swap x0 and x1
		uint16_t temp_x = x0;
		x0 = x1;
		x1 = temp_x;
	}

	// Calculate the horizontal and vertical distances
	int16_t dx = x1 - x0;
	int16_t dy = y1 - y0;

	// Determine the step direction for the x-axis
	int16_t x_direction = (dx < 0) ? -1 : 1;
	if (dx < 0)
		dx = -dx;

	// Initialize Bresenham's decision variables (swapped dy and dx)
	int16_t decision_parameter = (2 * dx) - dy;
	int16_t x = x0;

	// Iterate across the y-axis
	for (int16_t y = y0; y <= y1; y++)
	{
		// Draw the character at (x, y) in the framebuffer
		__DrawChar(c, x, y);

		// Check if decision variable is positive then move to the next x
		if (decision_parameter > 0)
		{
			x += x_direction;
			// Update error for step in both Y and X
			decision_parameter += (2 * (dx - dy));
		} else
		{
			// Update error for step in Y only
			decision_parameter += (2 * dx);
		}
	}
}

/**
 * @fn static void __DrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Internal function for drawing a line between two points using Bresenham's algorithm.
 * This function determines whether to draw a horizontal or vertical line based on
 * the slope and updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
static void __DrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Calculate absolute horizontal and vertical distances
	int16_t absolute_x = abs(x1 - x0);
	int16_t absolute_y = abs(y1 - y0);

	// Choose to draw either a horizontal or vertical line based on greater distance between points
	if (absolute_x > absolute_y)
		// The line is "flat" (more horizontal than vertical)
		__DrawLineHorizontal(c, x0, y0, x1, y1);
	else
		// Line is "steep" (more vertical than horizontal)
		__DrawLineVertical(c, x0, y0, x1, y1);
}

/* Public Functions ----------------------------------------------------------*/
/**
 * @fn void TerminalInit(uint8_t cursor, uint16_t col, uint16_t row)
 * @brief Initializes the terminal by setting cursor visibility, clearing the screen,
 * and clearing the internal framebuffer.
 * @param cursor TRUE to show the cursor, FALSE to hide it.
 * @param col The number of columns for the terminal (1-based index).
 * @param row The number of rows for the terminal (1-based index).
 */
void TerminalInit(uint8_t cursor, uint16_t col, uint16_t row)
{
	// Set the terminal dimensions based on provided parameters
	TerminalSetDimensions(col, row);

	// Set cursor visibility based on parameter
	if (cursor == TRUE)
		TerminalVisibleCursor();
	else
		TerminalInvisibleCursor();

	// Clear and home the terminal display
	TerminalClearAndHome();

	// Clear the internal framebuffer
	TerminalBufferClear();

	// Reset terminal styling to default
	TerminalResetStyle();

	// Log successful initialization of the terminal
	SerialPrint("DEBUG: Terminal initialized successfully\r\n");
}

/**
 * @fn void TerminalSetDimensions(uint16_t col, uint16_t row)
 * @brief Sets the terminal dimensions by sending the appropriate ANSI escape sequence.
 * This function formats the ANSI command to resize the terminal window to the specified
 * number of columns and rows. It ensures that the provided dimensions are valid and
 * sends the command via the serial interface.
 * @param col The desired number of columns for the terminal (1-based index).
 * @param row The desired number of rows for the terminal (1-based index).
 */
void TerminalSetDimensions(uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Temporary buffer to hold the ANSI escape sequence (enough for ESC[8;255;255t)
	char buffer[DIMENSIONS_BUFFER_SIZE];

	// Format the xterm resize sequence: ESC [ 8 ; <rows> ; <cols> t
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "8;%u;%ut", (unsigned int)row, (unsigned int)col);

	// Check if snprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence using the precise length calculated by snprintf
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalClearScreen(void)
 * @brief Sends the ANSI escape sequence to clear the entire terminal screen.
 * This function uses the CLEAR_SCREEN (ESC[2J) to erase all content
 * displayed in the terminal window.
 */
void TerminalClearScreen(void)
{
	// Transmit the ANSI command string for clearing the entire screen
	SerialPrint(ANSI_CLEAR_SCREEN);
}

/**
 * @fn void TerminalClearAndHome(void)
 * @brief Sends the combined ANSI escape sequence to clear the screen AND move the cursor to home (1,1).
 * This function uses the ANSI_CLS_HOME define (ESC[2JESC[H).
 */
void TerminalClearAndHome(void)
{
	// Transmit the combined ANSI command string for clearing the screen and setting the cursor to home (1,1)
	SerialPrint(ANSI_CLS_HOME);
}

/**
 * @fn void TerminalCursorHome(void)
 * @brief Sends the ANSI escape sequence to move the terminal cursor to the home position (1,1).
 * This function uses the ANSI_CURSOR_HOME (ESC[H) to quickly reposition
 * the cursor to the top-left corner of the terminal screen.
 */
void TerminalCursorHome(void)
{
	// Transmit the ANSI command string for moving the cursor to (1,1)
	SerialPrint(ANSI_CURSOR_HOME);
}

/**
 * @fn void TerminalInvisibleCursor(void)
 * @brief Sends the ANSI escape sequence to hide the terminal cursor.
 * This function uses the ANSI_CURSOR_INVISIBLE (ESC[?25l) to make
 * the cursor invisible on the terminal display.
 */
void TerminalInvisibleCursor(void)
{
	// Transmit the ANSI command string for hiding the cursor
	SerialPrint(ANSI_CURSOR_INVISIBLE);
}

/**
 * @fn void TerminalVisibleCursor(void)
 * @brief Sends the ANSI escape sequence to show the terminal cursor.
 * This function uses the ANSI_CURSOR_VISIBLE (ESC[?25h) to make
 * the cursor visible on the terminal display.
 */
void TerminalVisibleCursor(void)
{
	// Transmit the ANSI command string for showing the cursor
	SerialPrint(ANSI_CURSOR_VISIBLE);
}

/**
 * @fn void TerminalSetCursorPos(uint16_t col, uint16_t row)
 * @brief Sends the ANSI escape sequence to explicitly set the terminal cursor position.
 * The ANSI command format is `ESC[<row>;<col>H`.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
void TerminalSetCursorPos(uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!__IsValidPos(col, row))
		return;

	// Temporary buffer to hold the ANSI escape sequence (enough for a command like ESC[255;255H)
	char buffer[CURSOR_BUFFER_SIZE];

	// Format the escape sequence to move the cursor and return the length
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%u;%uH", (unsigned int)row, (unsigned int)col);

